In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, inspect
from functools import reduce

pd.options.display.float_format = "{:,.2f}".format

In [3]:
avgtemp_file = "Resources\GlobalLandTemperaturesByCountry.csv"
popdf_file = "Resources\population_total_long.csv"

avgtemp_df = pd.read_csv(avgtemp_file)
popdf = pd.read_csv(popdf_file)

In [4]:
avgtemp_df.dropna()

avgtemp_df=avgtemp_df.dropna()

In [5]:
avgtemp_df['dt'] = pd.to_datetime(avgtemp_df['dt'])
avgtemp_df.head()

          dt  AverageTemperature  AverageTemperatureUncertainty Country
0 1743-11-01                4.38                           2.29   Åland
5 1744-04-01                1.53                           4.68   Åland
6 1744-05-01                6.70                           1.79   Åland
7 1744-06-01               11.61                           1.58   Åland
8 1744-07-01               15.34                           1.41   Åland

In [6]:
avgtemp_df['Day'] = avgtemp_df['dt'].dt.day
avgtemp_df['Month'] = avgtemp_df['dt'].dt.month
avgtemp_df['Year'] = avgtemp_df['dt'].dt.year

avgtemp_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Day,Month,Year
0,1743-11-01,4.38,2.29,Åland,1,11,1743
5,1744-04-01,1.53,4.68,Åland,1,4,1744
6,1744-05-01,6.70,1.79,Åland,1,5,1744
7,1744-06-01,11.61,1.58,Åland,1,6,1744
8,1744-07-01,15.34,1.41,Åland,1,7,1744

In [7]:
avgtemp_df = avgtemp_df[(avgtemp_df.Year >= 1963) & (avgtemp_df.Year <= 2013)]

avgtemp_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Day,Month,Year
2630,1963-01-01,-6.29,0.98,Åland,1,1,1963
2631,1963-02-01,-8.08,0.59,Åland,1,2,1963
2632,1963-03-01,-5.51,0.56,Åland,1,3,1963
2633,1963-04-01,1.45,0.74,Åland,1,4,1963
2634,1963-05-01,9.56,0.43,Åland,1,5,1963

In [8]:
atdf = avgtemp_df.groupby( [ "Year", "Country"] ) ['AverageTemperature'].mean().to_frame().reset_index()

atdf.head()

   Year         Country  AverageTemperature
0  1963     Afghanistan               15.03
1  1963          Africa               24.27
2  1963         Albania               13.09
3  1963         Algeria               23.32
4  1963  American Samoa               26.86

In [9]:
atdf.head()

   Year         Country  AverageTemperature
0  1963     Afghanistan               15.03
1  1963          Africa               24.27
2  1963         Albania               13.09
3  1963         Algeria               23.32
4  1963  American Samoa               26.86

In [10]:
merged_df = pd.merge(popdf, atdf,  how='inner', left_on=['Country Name','Year'], right_on = ['Country','Year'])

In [11]:
merged_df=merged_df[["Country","Year","Count","AverageTemperature"]]

In [12]:
merged_df.head()

       Country  Year    Count  AverageTemperature
0        Aruba  1963    56695               28.32
1  Afghanistan  1963  9543205               15.03
2       Angola  1963  5679458               21.84
3      Albania  1963  1762621               13.09
4      Andorra  1963    16412               10.64

In [13]:
# Filter to exclude undesired years
# Frequency: 10 years
# rename Count column to Population
new_df = merged_df[merged_df['Year'] % 10 == 3]
new_df = new_df.rename(columns={'Count':'Population'})
new_df.head()

       Country  Year  Population  AverageTemperature
0        Aruba  1963       56695               28.32
1  Afghanistan  1963     9543205               15.03
2       Angola  1963     5679458               21.84
3      Albania  1963     1762621               13.09
4      Andorra  1963       16412               10.64

In [14]:
# Arrange the data to caclculate the cascading difference
new_df = new_df.sort_values(["Country", "Year"], ascending = (True, True))

In [15]:
new_df.reset_index(drop=True, inplace=True)

In [16]:
# new_df["new_column"] = 1
# new_df

In [17]:
new_df["Average_temp_diff"] = new_df["AverageTemperature"].diff().fillna(0)
new_df["Population_diff"] = new_df["Population"].diff().fillna(0)

In [18]:
new_df

,Country,Year,Population,AverageTemperature,Average_temp_diff,Population_diff
0,Afghanistan,1963,9543205,15.03,0.00,0.00
1,Afghanistan,1973,12108963,14.24,-0.80,"2,565,758.00"
2,Afghanistan,1983,12537730,14.61,0.38,"428,767.00"
3,Afghanistan,1993,15816603,14.44,-0.18,"3,278,873.00"
4,Afghanistan,2003,23680871,14.92,0.48,"7,864,268.00"
...,...,...,...,...,...,...
992,Zimbabwe,1973,5877726,21.46,0.70,"1,699,000.00"
993,Zimbabwe,1983,8254747,22.37,0.91,"2,377,021.00"
994,Zimbabwe,1993,11092766,21.85,-0.51,"2,838,019.00"
995,Zimbabwe,2003,11982224,21.89,0.04,"889,458.00"
996,Zimbabwe,2013,13350356,20.71,-1.18,"1,368,132.00"

In [19]:
# create pivot table for population
Pop_df = pd.pivot_table(new_df, index=["Country"], columns=["Year"], values=["Population_diff"])
Pop_df

               Population_diff                                            \
Year                      1963          1973          1983          1993
Country
Afghanistan               0.00  2,565,758.00    428,767.00  3,278,873.00
Albania         -30,506,968.00    534,131.00    547,208.00    383,327.00
Algeria           9,017,711.00  3,797,022.00  5,392,050.00  6,533,640.00
American Samoa  -38,118,098.00      7,066.00      7,312.00     14,608.00
Andorra             -39,301.00     11,820.00     12,635.00     20,104.00
...                        ...           ...           ...           ...
Uruguay        -313,422,601.00    186,991.00    150,919.00    204,709.00
Uzbekistan        6,039,467.00  3,711,891.00  4,036,867.00  4,764,336.00
Vietnam           5,478,017.00 10,882,308.00 11,544,859.00 14,151,924.00
Zambia          -87,393,368.00  1,259,442.00  1,862,370.00  2,174,570.00
Zimbabwe        -10,747,778.00  1,699,000.00  2,377,021.00  2,838,019.00


Year                    2003         2013
Country
Afghanistan     7,864,268.00 8,588,718.00
Albania          -187,671.00  -144,524.00
Algeria         4,628,642.00 5,875,975.00
American Samoa      8,484.00    -3,791.00
Andorra            12,211.00     7,592.00
...                      ...          ...
Uruguay           145,923.00    65,771.00
Uzbekistan      3,625,650.00 4,675,550.00
Vietnam        10,001,348.00 8,451,816.00
Zambia          2,600,257.00 3,669,761.00
Zimbabwe          889,458.00 1,368,132.00

[167 rows x 6 columns]

In [20]:
# rename index and create country as a column
Poptable = Pop_df.reset_index()
Poptable

             Country Population_diff                              \
Year                            1963          1973          1983
0        Afghanistan            0.00  2,565,758.00    428,767.00
1            Albania  -30,506,968.00    534,131.00    547,208.00
2            Algeria    9,017,711.00  3,797,022.00  5,392,050.00
3     American Samoa  -38,118,098.00      7,066.00      7,312.00
4            Andorra      -39,301.00     11,820.00     12,635.00
..               ...             ...           ...           ...
162          Uruguay -313,422,601.00    186,991.00    150,919.00
163       Uzbekistan    6,039,467.00  3,711,891.00  4,036,867.00
164          Vietnam    5,478,017.00 10,882,308.00 11,544,859.00
165           Zambia  -87,393,368.00  1,259,442.00  1,862,370.00
166         Zimbabwe  -10,747,778.00  1,699,000.00  2,377,021.00


Year          1993          2003         2013
0     3,278,873.00  7,864,268.00 8,588,718.00
1       383,327.00   -187,671.00  -144,524.00
2     6,533,640.00  4,628,642.00 5,875,975.00
3        14,608.00      8,484.00    -3,791.00
4        20,104.00     12,211.00     7,592.00
..             ...           ...          ...
162     204,709.00    145,923.00    65,771.00
163   4,764,336.00  3,625,650.00 4,675,550.00
164  14,151,924.00 10,001,348.00 8,451,816.00
165   2,174,570.00  2,600,257.00 3,669,761.00
166   2,838,019.00    889,458.00 1,368,132.00

[167 rows x 7 columns]

In [21]:
# rename columns to sanitise table
Poptable.columns = ['Country', '1963', '1973', '1983', '1993','2003','2013']
Poptable

,Country,1963,1973,1983,1993,2003,2013
0,Afghanistan,0.00,"2,565,758.00","428,767.00","3,278,873.00","7,864,268.00","8,588,718.00"
1,Albania,"-30,506,968.00","534,131.00","547,208.00","383,327.00","-187,671.00","-144,524.00"
2,Algeria,"9,017,711.00","3,797,022.00","5,392,050.00","6,533,640.00","4,628,642.00","5,875,975.00"
3,American Samoa,"-38,118,098.00","7,066.00","7,312.00","14,608.00","8,484.00","-3,791.00"
4,Andorra,"-39,301.00","11,820.00","12,635.00","20,104.00","12,211.00","7,592.00"
...,...,...,...,...,...,...,...
162,Uruguay,"-313,422,601.00","186,991.00","150,919.00","204,709.00","145,923.00","65,771.00"
163,Uzbekistan,"6,039,467.00","3,711,891.00","4,036,867.00","4,764,336.00","3,625,650.00","4,675,550.00"
164,Vietnam,"5,478,017.00","10,882,308.00","11,544,859.00","14,151,924.00","10,001,348.00","8,451,816.00"
165,Zambia,"-87,393,368.00","1,259,442.00","1,862,370.00","2,174,570.00","2,600,257.00","3,669,761.00"
166,Zimbabwe,"-10,747,778.00","1,699,000.00","2,377,021.00","2,838,019.00","889,458.00","1,368,132.00"

In [22]:
# create pivot table for Average Temp

ATemp_df= pd.pivot_table(new_df, index=["Country"], columns=["Year"], values=["Average_temp_diff"])
ATemp_df

               Average_temp_diff
Year                        1963  1973  1983  1993  2003  2013
Country
Afghanistan                 0.00 -0.80  0.38 -0.18  0.48  1.62
Albania                    -3.45 -0.60  0.02  0.61  0.50  1.37
Algeria                     8.32 -0.43  0.80 -0.23  0.94  0.73
American Samoa              1.74  0.28 -0.21 -0.11  0.45  0.25
Andorra                   -16.88  0.54  0.82 -0.56  1.47 -0.59
...                          ...   ...   ...   ...   ...   ...
Uruguay                     6.21 -0.23  0.13  0.24 -0.04 -0.85
Uzbekistan                 -3.11 -0.73  1.18 -2.13  1.20  3.03
Vietnam                     7.57  0.58 -0.40 -0.01  0.56  0.73
Zambia                     -4.22  0.46  0.87 -0.63  0.45 -0.96
Zimbabwe                   -0.44  0.70  0.91 -0.51  0.04 -1.18

[167 rows x 6 columns]

In [23]:
# reset index so country is a column
ATemp = ATemp_df.reset_index()
ATemp

             Country Average_temp_diff
Year                              1963  1973  1983  1993  2003  2013
0        Afghanistan              0.00 -0.80  0.38 -0.18  0.48  1.62
1            Albania             -3.45 -0.60  0.02  0.61  0.50  1.37
2            Algeria              8.32 -0.43  0.80 -0.23  0.94  0.73
3     American Samoa              1.74  0.28 -0.21 -0.11  0.45  0.25
4            Andorra            -16.88  0.54  0.82 -0.56  1.47 -0.59
..               ...               ...   ...   ...   ...   ...   ...
162          Uruguay              6.21 -0.23  0.13  0.24 -0.04 -0.85
163       Uzbekistan             -3.11 -0.73  1.18 -2.13  1.20  3.03
164          Vietnam              7.57  0.58 -0.40 -0.01  0.56  0.73
165           Zambia             -4.22  0.46  0.87 -0.63  0.45 -0.96
166         Zimbabwe             -0.44  0.70  0.91 -0.51  0.04 -1.18

[167 rows x 7 columns]

In [24]:
# rename columns to sanitise table
ATemp.columns = ['Country', '1963', '1973', '1983', '1993','2003','2013']
ATemp

            Country   1963  1973  1983  1993  2003  2013
0       Afghanistan   0.00 -0.80  0.38 -0.18  0.48  1.62
1           Albania  -3.45 -0.60  0.02  0.61  0.50  1.37
2           Algeria   8.32 -0.43  0.80 -0.23  0.94  0.73
3    American Samoa   1.74  0.28 -0.21 -0.11  0.45  0.25
4           Andorra -16.88  0.54  0.82 -0.56  1.47 -0.59
..              ...    ...   ...   ...   ...   ...   ...
162         Uruguay   6.21 -0.23  0.13  0.24 -0.04 -0.85
163      Uzbekistan  -3.11 -0.73  1.18 -2.13  1.20  3.03
164         Vietnam   7.57  0.58 -0.40 -0.01  0.56  0.73
165          Zambia  -4.22  0.46  0.87 -0.63  0.45 -0.96
166        Zimbabwe  -0.44  0.70  0.91 -0.51  0.04 -1.18

[167 rows x 7 columns]

# SQL Schema

In [25]:
engine = create_engine('sqlite:///save_pandas.db', echo=True)
sqlite_connection = engine.connect()

In [26]:
sqlite_table = "Pop"
Poptable.to_sql(sqlite_table, sqlite_connection, if_exists='replace')

2021-10-12 21:58:20,024 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Pop")
2021-10-12 21:58:20,029 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,032 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Pop")
2021-10-12 21:58:20,034 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,036 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-10-12 21:58:20,038 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,040 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("Pop")
2021-10-12 21:58:20,041 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,045 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,047 INFO sqlalchemy.engine.Engine [raw sql] ('Pop',)
2021-10-12 21:58:20,050 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("Pop")
2021-10-12 21:58:20,052 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,054 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("Pop")
2021-10-12 21:58:20,055 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,056 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,057 INFO sqlalchemy.engine.Engine [raw sql] ('Pop',)
2021-10-12 21:58:20,060 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Pop")
2021-10-12 21:58:20,061 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,063 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_Pop_index")
2021-10-12 21:58:20,064 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,066 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Pop")
2021-10-12 21:58:20,066 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,068 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_Pop_index")
2021-10-12 21:58:20,069 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,070 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,070 INFO sqlalchemy.engine.Engine [raw sql] ('Pop',)
2021-10-12 21:58:20,074 INFO sqlalchemy.engine.Engine
DROP TABLE "Pop"
2021-10-12 21:58:20,075 INFO sqlalchemy.engine.Engine [no key 0.00082s] ()
2021-10-12 21:58:20,080 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,084 INFO sqlalchemy.engine.Engine
CREATE TABLE "Pop" (
	"index" BIGINT,
	"Country" TEXT,
	"1963" FLOAT,
	"1973" FLOAT,
	"1983" FLOAT,
	"1993" FLOAT,
	"2003" FLOAT,
	"2013" FLOAT
)


2021-10-12 21:58:20,085 INFO sqlalchemy.engine.Engine [no key 0.00089s] ()
2021-10-12 21:58:20,092 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,093 INFO sqlalchemy.engine.Engine CREATE INDEX "ix_Pop_index" ON "Pop" ("index")
2021-10-12 21:58:20,094 INFO sqlalchemy.engine.Engine [no key 0.00086s] ()
2021-10-12 21:58:20,100 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,104 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-12 21:58:20,108 INFO sqlalchemy.engine.Engine INSERT INTO "Pop" ("index", "Country", "1963", "1973", "1983", "1993", "2003", "2013") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
2021-10-12 21:58:20,109 INFO sqlalchemy.engine.Engine [generated in 0.00178s] ((0, 'Afghanistan', 0.0, 2565758.0, 428767.0, 3278873.0, 7864268.0, 8588718.0), (1, 'Albania', -30506968.0, 534131.0, 547208.0, 383327.0, -187671.0, -144524.0), (2, 'Algeria', 9017711.0, 3797022.0, 5392050.0, 6533640.0, 4628642.0, 5875975.0), (3, 'American Samoa', -38118098.0, 7066.0, 7312.0, 14608.0, 8484.0, -3791.0), (4, 'Andorra', -39301.0, 11820.0, 12635.0, 20104.0, 12211.0, 7592.0), (5, 'Angola', 5598684.0, 817504.0, 2781134.0, 3796953.0, 5046430.0, 7894301.0), (6, 'Argentina', -4526868.0, 3567566.0, 4205569.0, 4708064.0, 4117757.0, 4115067.0), (7, 'Armenia', -40125357.0, 635208.0, 525809.0, 124513.0, -345176.0, -120348.0)  ... displaying 10 of 167 total bound parameter sets ...  (165, 'Zambia', -87393368.0, 1259442.0, 1862370.0, 2174570.0, 2600257.0, 3669761.0), (166, 'Zimbabwe', -10747778.0, 1699000.0, 2377021.0, 2838019.0, 889458.0, 1368132.0))
2021-10-12 21:58:20,112 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,118 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-10-12 21:58:20,120 INFO sqlalchemy.engine.Engine [raw sql] ()

In [27]:
sqlite_table = "Temp"
ATemp.to_sql(sqlite_table, sqlite_connection, if_exists='replace')

2021-10-12 21:58:20,670 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Temp")
2021-10-12 21:58:20,671 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,673 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Temp")
2021-10-12 21:58:20,674 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,676 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-10-12 21:58:20,676 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,679 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("Temp")
2021-10-12 21:58:20,680 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,682 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,683 INFO sqlalchemy.engine.Engine [raw sql] ('Temp',)
2021-10-12 21:58:20,685 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("Temp")
2021-10-12 21:58:20,685 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,686 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("Temp")
2021-10-12 21:58:20,687 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,688 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,689 INFO sqlalchemy.engine.Engine [raw sql] ('Temp',)
2021-10-12 21:58:20,691 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Temp")
2021-10-12 21:58:20,692 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,693 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_Temp_index")
2021-10-12 21:58:20,694 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,696 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Temp")
2021-10-12 21:58:20,696 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,698 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_Temp_index")
2021-10-12 21:58:20,698 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-10-12 21:58:20,700 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-10-12 21:58:20,701 INFO sqlalchemy.engine.Engine [raw sql] ('Temp',)
2021-10-12 21:58:20,703 INFO sqlalchemy.engine.Engine
DROP TABLE "Temp"
2021-10-12 21:58:20,704 INFO sqlalchemy.engine.Engine [no key 0.00083s] ()
2021-10-12 21:58:20,714 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,717 INFO sqlalchemy.engine.Engine
CREATE TABLE "Temp" (
	"index" BIGINT,
	"Country" TEXT,
	"1963" FLOAT,
	"1973" FLOAT,
	"1983" FLOAT,
	"1993" FLOAT,
	"2003" FLOAT,
	"2013" FLOAT
)


2021-10-12 21:58:20,719 INFO sqlalchemy.engine.Engine [no key 0.00165s] ()
2021-10-12 21:58:20,726 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,728 INFO sqlalchemy.engine.Engine CREATE INDEX "ix_Temp_index" ON "Temp" ("index")
2021-10-12 21:58:20,729 INFO sqlalchemy.engine.Engine [no key 0.00116s] ()
2021-10-12 21:58:20,736 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,739 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-10-12 21:58:20,744 INFO sqlalchemy.engine.Engine INSERT INTO "Temp" ("index", "Country", "1963", "1973", "1983", "1993", "2003", "2013") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
2021-10-12 21:58:20,745 INFO sqlalchemy.engine.Engine [generated in 0.00316s] ((0, 'Afghanistan', 0.0, -0.7979166666666657, 0.3793333333333333, -0.17558333333333387, 0.47674999999999734, 1.617625000000002), (1, 'Albania', -3.4477916666666673, -0.5991666666666671, 0.024250000000000327, 0.6116666666666664, 0.5040000000000013, 1.3672916666666666), (2, 'Algeria', 8.323958333333335, -0.4316666666666684, 0.7968333333333355, -0.23216666666666796, 0.9428333333333292, 0.7278333333333364), (3, 'American Samoa', 1.7361666666666622, 0.28058333333333607, -0.209583333333331, -0.11224999999999952, 0.44841666666666313, 0.25241666666666873), (4, 'Andorra', -16.881083333333336, 0.5404166666666672, 0.8151666666666681, -0.5595833333333342, 1.4684999999999988, -0.5927916666666668), (5, 'Angola', 9.529875, 0.5119166666666679, 0.017583333333334394, -0.0762500000000017, 0.77558333333333, -0.5587083333333318), (6, 'Argentina', -7.660708333333332, -0.2492499999999982, 0.3564166666666644, 0.14433333333333387, 0.4196666666666662, -1.061208333333333), (7, 'Armenia', -5.184125, -1.065833333333332, 0.7934166666666655, -1.2309166666666664, 1.6534166666666659, 1.9206666666666674)  ... displaying 10 of 167 total bound parameter sets ...  (165, 'Zambia', -4.217541666666666, 0.46458333333333357, 0.8669166666666683, -0.6345000000000027, 0.44516666666666893, -0.9607500000000044), (166, 'Zimbabwe', -0.4394999999999989, 0.7039166666666645, 0.9067500000000024, -0.514916666666668, 0.03900000000000148, -1.1804999999999986))
2021-10-12 21:58:20,749 INFO sqlalchemy.engine.Engine COMMIT
2021-10-12 21:58:20,754 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-10-12 21:58:20,756 INFO sqlalchemy.engine.Engine [raw sql] ()

In [28]:
sqlite_connection.close()